<?php

return [

    /**
     *
     * ترجمات مشتركة.
     *
     */
    'title' => 'مُثبِّت Taskup',
    'next' => 'الخطوة التالية',
    'finish' => 'تثبيت',


    /**
     *
     * ترجمات صفحة الرئيسية.
     *
     */
    'welcome' => [
        'title'   => 'مرحبًا بك في مُثبِّت Taskup',
        'message' => 'مرحبًا بك في معالج الإعداد.',
    ],


    /**
     *
     * ترجمات صفحة المتطلبات.
     *
     */
    'requirements' => [
        'title' => 'المتطلبات',
        'message' => 'قبل أن تتابع، يرجى التأكد من أن <br > الخادم الخاص بك يلبي المتطلبات التالية.',
    ],


    /**
     *
     * ترجمات صفحة الأذونات.
     *
     */
    'permissions' => [
        'title' => 'الأذونات',
        'message' => 'يرجى التأكد من أن Taskup لديه الأذونات اللازمة <br /> للوصول إلى المجلدات التالية من أجل المتابعة.',
    ],

    /**
     *
     * مُصدِّرات قاعدة البيانات.
     *
     */
    'seeders' => [
        'title' => 'ترحيل واستيراد محتوى العرض التوضيحي',
        'migrate_title' => 'ترحيل قاعدة البيانات',
        'migrate_desc' => 'ترحيل مخطط وهيكل قاعدة البيانات لـ Taskup.',
        'general_title' => 'استيراد إعدادات الموقع',
        'general_desc' => 'يستورد الإعدادات والتكوينات الأساسية لموقعك.',
        'pages_title' => 'استيراد الصفحات والتخطيطات',
        'pages_desc' => 'يستورد جميع الصفحات الافتراضية وتخطيطاتهم لموقعك.',
        'users_title' => 'استيراد بيانات المستخدمين النموذجية',
        'users_desc' => 'يستورد ملفات تعريف وبيانات المستخدمين التجريبية لأغراض الاختبار.',
        'tooltip_text' => 'انقر على زر التالي لبدء الاستيراد',
        'migrate_tooltip_text' => 'انقر على زر التالي لبدء الترحيل',
        'import_text' => 'دعنا نرحل قاعدة البيانات ونستورد محتوى العرض التوضيحي إلى موقعك <br /> لمساعدتك في استكشاف وفهم منتجنا.',
    ],


    /**
     *
     * ترجمات صفحة البيئة.
     *
     */
    'environment' => [
        'title' => 'إعدادات البيئة',
        'message' => 'يرجى إدخال بيانات اعتماد قاعدة البيانات الخاصة بك للمتابعة.',
        'save' => 'حفظ .env',
        'success' => 'تم حفظ إعدادات ملف .env الخاص بك.',
        'errors' => 'غير قادر على حفظ ملف .env، يرجى إنشاؤه يدويًا.',
    ],
    
    'install' => 'تثبيت',


    /**
     *
     * ترجمات الصفحة النهائية.
     *
     */
    'final' => [
        'title' => 'انتهى',
        'finished' => 'تم تثبيت التطبيق بنجاح.',
        'exit' => 'انقر هنا للخروج',
    ],
    'checkPermissionAgain' => ' تحقق من الأذونات مرة أخرى'
];
