<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */
    //login
    'failed'                => 'Эти учетные данные не соответствуют нашим записям.',
    'password'              => 'Предоставленный пароль неверен.',
    'throttle'              => 'Слишком много попыток входа. Пожалуйста, попробуйте снова через :seconds секунд.',
    'email'                 => 'Email',
    'email_palceholder'     => 'Пожалуйста, введите ваш адрес электронной почты',
    'password_palceholder'  => 'Пожалуйста, введите ваш пароль',
    'login'                 => 'Войти',
    'register'              => 'Зарегистрироваться',
    'or'                    => 'ИЛИ',
    'signin_with_google'    => 'Войти с помощью Google',
    'join_us_today'         => 'Нет аккаунта?',
    'lost_password'         => 'Забыли пароль?',
    'choose_role'           => 'Выберите тип',

    // register
    'restrict_action'           => 'У вас нет прав на выполнение этого действия!',
    'first_name'                => 'Имя',
    'first_name_placeholder'    => 'Имя*',
    'last_name'                 => 'Фамилия',
    'last_name_placeholder'     => 'Фамилия*',
    'register_email'            => 'Ваш адрес электронной почты*',
    'register_password'         => 'Введите пароль*',
    'confirm_password'          => 'Подтвердите пароль',
    'confirm_password_placeholder'   => 'Подтвердите пароль*',
    'buyer'                     => 'Покупатель',
    'seller'                    => 'Продавец',
    'sign_in_today'             => 'Войти сегодня',
    'join_now'                  => 'Присоединиться сейчас',
    'read_all_terms'            => 'Я прочитал и согласен с',
    'terms_conditions'          => 'Условиями использования',
    'and'                       => 'и',
    'privacy_policy'            => 'Политикой конфиденциальности',
    'remember_me'               => 'Запомнить меня',
    'login_error'               => 'К сожалению, вы были выведены из системы из-за недостаточных прав доступа для вашей учетной записи. Для получения дополнительной информации свяжитесь с администратором.',
    'signin_today'              => 'Уже есть аккаунт?',
    'reset_link'                => 'Отправить ссылку для сброса',
    'reset_password'            => 'Сбросить пароль',
    'signin'                    => 'Войти',
    'email_or_username'         => 'Добавьте email или имя пользователя',
    'logout'                    => 'Выйти',
    'signin_desciption'         => 'Пожалуйста, введите ваш email и пароль для доступа к вашей учетной записи',
    'register_desciption'       => 'Мы рады приветствовать вас как участника нашего сообщества!',
    'forget_desciption'         => 'Пожалуйста, введите ваш email для сброса пароля',

    'failed'                    => 'Эти учетные данные не соответствуют нашим записям.',
    'incorrect_password'        => 'Предоставленный пароль неверен.',
    'throttle'                  => 'Слишком много попыток входа. Пожалуйста, повторите попытку через :seconds секунд.',
    'role_not_exist'            => 'Запрашиваемый тип пользователя не существует',
    'verify_email_desc'         => 'Спасибо за регистрацию! Прежде чем начать, пожалуйста, подтвердите свой адрес электронной почты, перейдя по ссылке, которую мы только что отправили вам на почту. Если вы не получили письмо, мы с радостью отправим вам еще одно.',
    'verify_email_link'         => 'Новая ссылка для подтверждения была отправлена на адрес электронной почты, указанный при регистрации.',
    'resend_verification_email' => 'Отправить повторно письмо для подтверждения',
    'confirm_password_desc'     => 'Это защищенная часть приложения. Пожалуйста, подтвердите ваш пароль перед продолжением.',
    'user_account_blocked'      => 'Ваш аккаунт был заблокирован администратором. Пожалуйста, свяжитесь с вашим администратором.'
];
