<?php

return [

    /*
    |--------------------------------------------------------------------------
    | All translation Lines
    |--------------------------------------------------------------------------
    
    @Identity verification taskup
    @package taskup
    @author  Amento Tech <info@amentotech.com>
    @license https://amentotech.com/
    @link    https://amentotech.com/
    */

    
    
    'heading'                   => 'Загрузка информации об идентификации',
    'name'                      => 'Ваше имя',
    'contact_number'            => 'Контактный номер',
    'identity_number'           => 'Номер национального удостоверения личности, паспорта или водительского удостоверения',
    'address'                   => 'Добавить адрес',
    'upload_files_desc'         => 'Вы можете загружать только медиафайлы, убедитесь, что размер файла не превышает :file_size. Нажмите здесь, чтобы загрузить',
    'button_desc'               => 'Нажмите «Сохранить и обновить», чтобы сохранить последние изменения',
    'sent_verification_request' => 'Вы успешно отправили свои документы. Держитесь крепче, мы скоро проверим и ответим на ваш запрос',
    'woohoo'                    => 'Ура!',
    'cancel_reupload'           => 'Отменить и загрузить заново',
    'hurray'                    => 'Ура!',
    'complete_verification'     => 'Мы успешно завершили вашу проверку личности. Теперь вы готовы использовать функции сайта',
    'attachments'               => 'Пожалуйста, загрузите документ',
    'verification_rejection'    => 'Ваши данные были отклонены. Пожалуйста, попробуйте еще раз с полными данными.',

    
];
